{
    "About":"À propos",
    "Projects":"Projets",
    "Skills":"Compétences",
    "Contact":"Contact",
    "Hello":"Bonjour",
    "I'm":"Je suis",
    "I'm a passionate Front-End Developer dedicated to building elegant, performant, and responsive web interfaces. With hands-on experience using React, Next.js, and Tailwind CSS, I focus on transforming ideas into intuitive and visually engaging user experiences.":"Je suis un développeur front-end passionné, dédié à la création d’interfaces web élégantes, performantes et réactives. Fort d’une expérience pratique avec React, Next.js et Tailwind CSS, je m’efforce de transformer les idées en expériences utilisateur intuitives et visuellement attrayantes.",
    "My Resume":"Mon CV",
    "Web Server":"Serveur Web",
    "A lightweight HTTP server built from scratch, focused on handling requests and responses efficiently, simulating real-world web server behavior.":"Un serveur HTTP léger construit à partir de zéro, axé sur la gestion efficace des requêtes et des réponses, simulant le comportement d'un serveur web réel.",
    "Pong Game":"Jeu de Pong",
    "A modern twist on the classic Pong game, combining multiplayer functionality with user authentication and social features for an immersive experience.":"Une touche moderne sur le jeu classique Pong, combinant la fonctionnalité multijoueur avec l'authentification de l'utilisateur et les fonctionnalités sociales pour une expérience immersive.",
    "Inception":"Inception",
    "A Docker-based project showcasing virtualization by creating a multi-container setup for hosting various services securely.":"Un projet basé sur Docker présentant la virtualisation en créant une configuration multi-conteneurs pour héberger divers services en toute sécurité.",
    "A personal portfolio showcasing my work as a full-stack developer.":"Un portfolio personnel présentant mon travail en tant que développeur full-stack.",
    "Drop me a message":"Laissez-moi un message",
    "Full Name":"Nom complet",
    "Email":"Email",
    "Message":"Message",
    "Send":"Envoyer",
    "Designed and Developed by":"Conçu et développé par",
    "Front End Developer":"Développeur Front End",
    "Others":"Autres",
    "Show More":"Voir plus",
    "Show Less":"Voir moins",
    "Availability": "Disponibilité",
    "Open to full-time, part-time and freelance opportunities": "Ouvert aux opportunités à temps plein, à temps partiel et en freelance",
    "Full-time": "Temps plein",
    "Freelance": "Freelance",
    "Contract": "Contrat",
    "Contact me": "Contactez-moi",
    "Quick links": "Liens rapides",
    "Follow": "Suivez-moi",
    "Back to top": "Retour en haut",
    "Built with Next.js • Tailwind CSS": "Construit avec Next.js • Tailwind CSS",
    "Technologies I use to build reliable, fast and maintainable software.": "Technologies que j'utilise pour construire des logiciels fiables, rapides et maintenables.",
    "items": "éléments"
    ,"Education": "Éducation",
    "Frontend": "Frontend",
    "Backend & APIs": "Backend et API",
    "Systems & DevOps": "Systèmes & DevOps",
    "Tools & Others": "Outils & autres",
    "Selected projects that showcase my skills in systems programming, web development and container orchestration.": "Projets sélectionnés qui mettent en valeur mes compétences en programmation système, développement web et orchestration de conteneurs.",
    "Hire me": "Engagez-moi"
    ,"I learned various programming languages and computer science concepts through hands-on projects and peer-to-peer learning.": "J'ai appris divers langages de programmation et concepts en informatique grâce à des projets pratiques et à l'apprentissage entre pairs.",
    "Completed foundational coursework in physics and mathematics, preparing for advanced studies in computer science.": "Cours fondamentaux en physique et mathématiques complétés, préparant à des études avancées en informatique.",
    "Graduated with a focus on life and earth sciences, developing analytical and scientific skills.": "Diplômé avec une spécialisation en sciences de la vie et de la Terre, développant des compétences analytiques et scientifiques.",
        "A summary of my academic background and qualifications.":"Un résumé de mon parcours académique et de mes qualifications.",
    "Cub3D": "Cub3D",
    "Cub3D_desc": "Un jeu de labyrinthe 3D construit en utilisant le raycasting, permettant aux joueurs de naviguer dans un labyrinthe et de collecter des objets pour gagner.",
    "Web Server_desc": "Un serveur HTTP léger construit à partir de zéro, axé sur la gestion efficace des requêtes et des réponses.",
    "Inception_desc": "Configuration multi-conteneurs basée sur Docker démontrant un déploiement de services sécurisé et une orchestration.",
    "Pong Game_desc": "Une version moderne de Pong avec des fonctionnalités multijoueurs, authentification et éléments sociaux pour une expérience engageante.",
    "Portfolio": "Portfolio",
    "Portfolio_desc": "Ce site portfolio construit avec Next.js, TailwindCSS et i18n.",
    "rhmetrics": "rhmetrics",
    "rhmetrics_desc": "Plateforme d'études de marché RH avec support multilingue et tableaux de bord basés sur les données.",
    "MyJoboard": "MyJoboard",
    "MyJoboard_desc": "Plateforme de recherche d'emploi avec fonctionnalités de recherche et de candidature.",
    "All": "Tous",
    "Web Development": "Développement Web",
    "Systems Programming": "Programmation Système",
    "DevOps": "DevOps",
    "Featured": "En vedette",
    "Live": "En direct",
    "View Code": "Voir le code",
    "Visit Website": "Visiter le site",
    "Previous": "Précédent",
    "Next": "Suivant",
    "No projects found in this category": "Aucun projet trouvé dans cette catégorie",
    "Language": "Langue",
    "Light Mode": "Mode clair",
    "Dark Mode": "Mode sombre",
    "Front End Developer": "Développeur Front-End",
    "Years": "Années",
    "Technologies": "Technologies",
    "Tech Stack": "Pile Technologique",
    "In Progress": "En cours",
    "Completed": "Terminé",
    "Graduated": "Diplômé",
    "Key Learning Areas": "Domaines d'apprentissage clés",
    "Click to collapse": "Cliquez pour réduire",
    "Click to expand": "Cliquez pour développer",
    "technologies": "technologies",
    "GitHub Statistics": "Statistiques GitHub",
    "Live stats from my repositories": "Statistiques en direct de mes dépôts",
    "Loading GitHub stats...": "Chargement des statistiques GitHub...",
    "View on GitHub": "Voir sur GitHub",
    "Repositories": "Dépôts",
    "Total Stars": "Total d'étoiles",
    "Followers": "Abonnés",
    "Let's work together on your next project": "Travaillons ensemble sur votre prochain projet",
    "Contact Information": "Informations de contact",
    "Location": "Localisation",
    "Connect with me": "Connectez-vous avec moi",
    "I'll get back to you as soon as possible": "Je vous répondrai dans les plus brefs délais",
    "Enter your full name": "Entrez votre nom complet",
    "your.email@example.com": "votre.email@exemple.com",
    "Tell me about your project...": "Parlez-moi de votre projet...",
    "Send Message": "Envoyer le message",
    "Sending...": "Envoi en cours...",
    "Please fill in all fields": "Veuillez remplir tous les champs",
    "Message sent successfully": "Message envoyé avec succès",
    "An error occurred, Please try again later": "Une erreur s'est produite, veuillez réessayer plus tard",
    "Download Resume": "Télécharger le CV"
}