{
    "About":"À propos",
    "Projects":"Projets",
    "Skills":"Compétences",
    "Contact":"Contact",
    "Hello":"Bonjour",
    "I'm":"Je suis",
    "I'm a passionate Front-End Developer dedicated to building elegant, performant, and responsive web interfaces. With hands-on experience using React, Next.js, and Tailwind CSS, I focus on transforming ideas into intuitive and visually engaging user experiences.":"Je suis un développeur front-end passionné, dédié à la création d’interfaces web élégantes, performantes et réactives. Fort d’une expérience pratique avec React, Next.js et Tailwind CSS, je m’efforce de transformer les idées en expériences utilisateur intuitives et visuellement attrayantes.",
    "My Resume":"Mon CV",
    "Web Server":"Serveur Web",
    "A lightweight HTTP server built from scratch, focused on handling requests and responses efficiently, simulating real-world web server behavior.":"Un serveur HTTP léger construit à partir de zéro, axé sur la gestion efficace des requêtes et des réponses, simulant le comportement d'un serveur web réel.",
    "Pong Game":"Jeu de Pong",
    "A modern twist on the classic Pong game, combining multiplayer functionality with user authentication and social features for an immersive experience.":"Une touche moderne sur le jeu classique Pong, combinant la fonctionnalité multijoueur avec l'authentification de l'utilisateur et les fonctionnalités sociales pour une expérience immersive.",
    "Inception":"Inception",
    "A Docker-based project showcasing virtualization by creating a multi-container setup for hosting various services securely.":"Un projet basé sur Docker présentant la virtualisation en créant une configuration multi-conteneurs pour héberger divers services en toute sécurité.",
    "A personal portfolio showcasing my work as a full-stack developer.":"Un portfolio personnel présentant mon travail en tant que développeur full-stack.",
    "Drop me a message":"Laissez-moi un message",
    "Full Name":"Nom complet",
    "Email":"Email",
    "Message":"Message",
    "Send":"Envoyer",
    "Designed and Developed by":"Conçu et développé par",
    "Front End Developer":"Développeur Front End",
    "Others":"Autres",
    "Show More":"Voir plus",
    "Show Less":"Voir moins",
    "Availability": "Disponibilité",
    "Open to full-time, part-time and freelance opportunities": "Ouvert aux opportunités à temps plein, à temps partiel et en freelance",
    "Full-time": "Temps plein",
    "Freelance": "Freelance",
    "Contract": "Contrat",
    "Contact me": "Contactez-moi",
    "Quick links": "Liens rapides",
    "Follow": "Suivez-moi",
    "Back to top": "Retour en haut",
    "Built with Next.js • Tailwind CSS": "Construit avec Next.js • Tailwind CSS",
    "Technologies I use to build reliable, fast and maintainable software.": "Technologies que j'utilise pour construire des logiciels fiables, rapides et maintenables.",
    "items": "éléments",
    "Built with passion and modern technologies": "Construit avec passion et des technologies modernes",
    "All rights reserved": "Tous les droits réservés",
    "Designed & Developed with": "Conçu & Développé avec",
    "by AE": "par AE",
    "Back to top": "Retour au haut",
    "status: ready": "statut: prêt",
    "Experience": "Expérience",
    "My professional journey and work experience": "Mon parcours professionnel et mes expériences de travail",
    "Full Stack Developer": "Développeur Full Stack",
    "Freelance": "Freelance",
    "Remote": "À distance",
    "2025 - Present": "2025 - Présent",
    "Working as a freelance full-stack developer, creating custom web applications for various clients. Specializing in modern JavaScript frameworks and Python backend development.": "Travaillant en tant que développeur full-stack indépendant, créant des applications web personnalisées pour divers clients. Spécialisé dans les frameworks JavaScript modernes et le développement backend Python.",
    "Delivered 4+ successful projects for international clients": "4+ projets réussis livrés pour des clients internationaux",
    "Built scalable web applications using Next.js, React, and Django": "Applications web évolutives construites avec Next.js, React et Django",
    "Maintained 100% client satisfaction with on-time delivery and quality code": "Satisfaction client 100% maintenue avec livraison à temps et code de qualité",
    "Frontend Developer": "Développeur Frontend",
    "talentech Solutions": "talentech Solutions",
    "Technopark, Casablanca": "Technopark, Casablanca",
    "2025/01 - 2025/07": "2025/01 - 2025/07",
    "Developed two complete web platforms from scratch using Next.js, React, and Tailwind CSS, ensuring responsive layouts and smooth user experience.": "Deux plateformes web complètes développées à partir de zéro en utilisant Next.js, React et Tailwind CSS, assurant des mises en page réactives et une expérience utilisateur fluide.",
    "Implemented clean component structures and optimized rendering, reducing UI load time and improving overall UX.": "Structures de composants propres implémentées et rendu optimisé, réduisant le temps de chargement de l'interface utilisateur et améliorant l'expérience utilisateur globale.",
    "Delivered 2 projects with 100% satisfaction rate": "2 projets livrés avec un taux de satisfaction de 100%",
    "Optimized web applications for maximum speed and scalability.": "Applications web optimisées pour une vitesse et une scalabilité maximales.",
    "Key Achievements": "Réalisations clés",
    "Technologies Used": "Technologies utilisées",
    "Internship": "Stage",
    "Welcome to My Terminal": "Bienvenue dans mon Terminal 🚀",
    "Hello! I'm Abdellatyf En-Neiymy": "Bonjour! Je suis Abdellatyf En-Neiymy",
    "This is an interactive terminal where you can learn more about me.": "Ceci est un terminal interactif où vous pouvez en savoir plus sur moi.",
    "Type help to see available commands or just explore around!": "Tapez \"help\" pour voir les commandes disponibles ou explorez simplement!",
    "I'm a passionate Front-End Developer": "Je suis un développeur Front-End passionné",
    "Building elegant, performant web experiences": "Construire des expériences web élégantes et performantes",
    "with React, Next.js & Tailwind CSS": "avec React, Next.js & Tailwind CSS",
    "Transforming ideas into intuitive UX/UI": "Transformer les idées en UX/UI intuitives",
    "Available commands:": "Commandes disponibles:",
    "Show about me": "Afficher à propos de moi",
    "Show education background": "Afficher l'historique de l'éducation",
    "List my skills": "Lister mes compétences",
    "Show contact information": "Afficher les informations de contact",
    "List recent projects": "Lister les projets récents",
    "Show my availability": "Afficher ma disponibilité",
    "Clear the terminal": "Effacer le terminal",
    "Close the terminal": "Fermer le terminal",
    "I am Abdellatyf En-Neiymy, a Front-End Developer specializing in building responsive and user-friendly web applications using React, Next.js, and Tailwind CSS.": "Je suis Abdellatyf En-Neiymy, un développeur Front-End spécialisé dans la création d'applications web réactives et conviviales utilisant React, Next.js et Tailwind CSS.",
    "I'm Currently Studying Software Engineering at 1337 School in Khouribga, Morocco. I have completed various courses and projects that have strengthened my skills in web development and programming.": "J'étudie actuellement l'ingénierie logicielle à l'école 1337 à Khouribga, au Maroc. J'ai suivi divers cours et projets qui ont renforcé mes compétences en développement web et en programmation.",
    "My Skills in Front-End Development:": "Mes compétences en développement Front-End:",
    "And also familiar with Back-End basics:": "Et aussi familier avec les bases du Back-End:",
    "You can reach me at Email: ab.enneiymy@gmail.com | GitHub: github.com/Abdlatif-20 | LinkedIn: linkedin.com/in/aben-nei/ | Whatsapp: +212777191684": "Vous pouvez me contacter par Email: ab.enneiymy@gmail.com | GitHub: github.com/Abdlatif-20 | LinkedIn: linkedin.com/in/aben-nei/ | Whatsapp: +212777191684",
    "Recent Projects:": "Projets récents:",
    "Portfolio Website - A personal portfolio built with Next.js and Tailwind CSS.": "Site de portfolio - Un portfolio personnel construit avec Next.js et Tailwind CSS.",
    "PongGame - A classic pong game using Nextjs and TypeScript in front end and Django in back end.": "PongGame - Un jeu de pong classique utilisant Nextjs et TypeScript en front-end et Django en back-end.",
    "HR Stats for Employees - An HR management dashboard built with React and Chart.js.": "Statistiques RH pour les employés - Un tableau de bord de gestion RH construit avec React et Chart.js.",
    "You can find more on my Projects section": "Vous pouvez en trouver plus dans ma section Projets",
    "I am currently open to full-time, part-time, and freelance opportunities. Feel free to contact me for collaborations or job offers!": "Je suis actuellement ouvert aux opportunités à temps plein, à temps partiel et en freelance. N'hésitez pas à me contacter pour des collaborations ou des offres d'emploi!",
    "Terminal cleared": "Terminal effacé",
    "Command not found. Type help for available commands.": "Commande non trouvée. Tapez \"help\" pour les commandes disponibles.",
    "Interactive Terminal": "Terminal Interactif",
    "Type command...": "Tapez une commande...",
    "Close": "Fermer",
    "Minimize": "Réduire",
    "Maximize": "Agrandir",
    "Click to open terminal": "Cliquez pour ouvrir le terminal",
    "Terminal": "Terminal",
    "Years": "Ans",
    "Technologies": "Technologies"
    ,"Education": "Éducation",
    "Frontend": "Frontend",
    "Backend & APIs": "Backend et API",
    "Systems & DevOps": "Systèmes & DevOps",
    "Tools & Others": "Outils & autres",
    "Selected projects that showcase my skills in systems programming, web development and container orchestration.": "Projets sélectionnés qui mettent en valeur mes compétences en programmation système, développement web et orchestration de conteneurs.",
    "Hire me": "Engagez-moi"
    ,"I learned various programming languages and computer science concepts through hands-on projects and peer-to-peer learning.": "J'ai appris divers langages de programmation et concepts en informatique grâce à des projets pratiques et à l'apprentissage entre pairs.",
    "Completed foundational coursework in physics and mathematics, preparing for advanced studies in computer science.": "Cours fondamentaux en physique et mathématiques complétés, préparant à des études avancées en informatique.",
    "Graduated with a focus on life and earth sciences, developing analytical and scientific skills.": "Diplômé avec une spécialisation en sciences de la vie et de la Terre, développant des compétences analytiques et scientifiques.",
        "A summary of my academic background and qualifications.":"Un résumé de mon parcours académique et de mes qualifications.",
    "Cub3D": "Cub3D",
    "Cub3D_desc": "Un jeu de labyrinthe 3D construit en utilisant le raycasting, permettant aux joueurs de naviguer dans un labyrinthe et de collecter des objets pour gagner.",
    "Web Server_desc": "Un serveur HTTP léger construit à partir de zéro, axé sur la gestion efficace des requêtes et des réponses.",
    "Inception_desc": "Configuration multi-conteneurs basée sur Docker démontrant un déploiement de services sécurisé et une orchestration.",
    "Pong Game_desc": "Une version moderne de Pong avec des fonctionnalités multijoueurs, authentification et éléments sociaux pour une expérience engageante.",
    "Portfolio": "Portfolio",
    "Portfolio_desc": "Ce site portfolio construit avec Next.js, TailwindCSS et i18n.",
    "rhmetrics": "rhmetrics",
    "rhmetrics_desc": "Plateforme d'études de marché RH avec support multilingue et tableaux de bord basés sur les données.",
    "MyJoboard": "MyJoboard",
    "MyJoboard_desc": "Plateforme de recherche d'emploi avec fonctionnalités de recherche et de candidature.",
    "All": "Tous",
    "Web Development": "Développement Web",
    "Systems Programming": "Programmation Système",
    "DevOps": "DevOps",
    "Featured": "En vedette",
    "Live": "En direct",
    "View Code": "Voir le code",
    "Visit Website": "Visiter le site",
    "Previous": "Précédent",
    "Next": "Suivant",
    "No projects found in this category": "Aucun projet trouvé dans cette catégorie",
    "Language": "Langue",
    "Light Mode": "Mode clair",
    "Dark Mode": "Mode sombre",
    "Front End Developer": "Développeur Front-End",
    "Years": "Années",
    "Technologies": "Technologies",
    "Tech Stack": "Pile Technologique",
    "In Progress": "En cours",
    "Completed": "Terminé",
    "Graduated": "Diplômé",
    "Key Learning Areas": "Domaines d'apprentissage clés",
    "Click to collapse": "Cliquez pour réduire",
    "Click to expand": "Cliquez pour développer",
    "technologies": "technologies",
    "GitHub Statistics": "Statistiques GitHub",
    "Live stats from my repositories": "Statistiques en direct de mes dépôts",
    "Loading GitHub stats...": "Chargement des statistiques GitHub...",
    "View on GitHub": "Voir sur GitHub",
    "Repositories": "Dépôts",
    "Total Stars": "Total d'étoiles",
    "Followers": "Abonnés",
    "Let's work together on your next project": "Travaillons ensemble sur votre prochain projet",
    "Contact Information": "Informations de contact",
    "Location": "Localisation",
    "Connect with me": "Connectez-vous avec moi",
    "I'll get back to you as soon as possible": "Je vous répondrai dans les plus brefs délais",
    "Enter your full name": "Entrez votre nom complet",
    "your.email@example.com": "votre.email@exemple.com",
    "Tell me about your project...": "Parlez-moi de votre projet...",
    "Send Message": "Envoyer le message",
    "Sending...": "Envoi en cours...",
    "Please fill in all fields": "Veuillez remplir tous les champs",
    "Message sent successfully": "Message envoyé avec succès",
    "An error occurred, Please try again later": "Une erreur s'est produite, veuillez réessayer plus tard",
    "Download Resume": "Télécharger le CV"
}